package lb1

/*
Task
Задано масив M[1:N] натуральних чисел, упорядкований за не спаданням, тобто:
M[1] ← M[2] ← ⋯ ← M[N].
Знайти перше натуральне число, яке не представляється сумою ніяких елементів цього
масиву, при цьому сума може складатися і з одного доданка, але кожен елемент масиву може
входити в неї тільки один раз.
*/
func Task1(numbers []int64) int64 {
	var result int64 = 1

	for i := 0; i < len(numbers) && numbers[i] <= result; i++ {
		result = result + numbers[i]
	}

	return result
}
