package lb1

/*
Task:
Задані x та y – дві послідовності. Чи можна отримати послідовність x
викреслюванням елементів з y.
*/
func Task9[T string | int](x []T, y []T) bool {
	// У нас є дві послідовності, тобто два масиви

	// Щоб отримати послідовність X з послідовності Y використовуючи тільки викреслювання елементів
	// нам потрібно, щоб всі елементи послідовності X були в послідовності Y

	// Таким чином, результатом чи можна отримати X з Y викреслюванням буде перевірка на те, що всі X[1..n] є в Y

	//  = Оптимізації =
	// Спочатку ми можемо перевірити довжину масивів щоб не запускати перевірки
	// Щоб зроби складність O(n) (100 000 елементів за 0.009s, 1.000.000 за 0.182s), а не O(n^2) (1.637s при 100 000 елементів, 1000000 за 30+s)
	// ми можемо згенерувати мапу по якій потім перевіряти чи валідний елемент, чи ні
	if len(y) < len(x) {
		return false
	}

	yMap := make(map[T]bool)

	for _, element := range y {
		yMap[element] = true
	}

	for _, element := range x {
		if !yMap[element] {
			return false
		}
	}

	return true
}
